tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18326_tdd.h
#define SSP2MSK_MSK5                  522
#define SSP2MSK5                      523
#define SSP2MSK_MSK6                  524
#define SSP2MSK6                      525
#define SSP2MSK_MSK7                  526
#define SSP2MSK7                      527
#define SSP2STAT                      528
#define SSP2STAT_BF                   529
#define SSP2STAT_UA                   530
#define SSP2STAT_R_nW                 531
#define SSP2STAT_S                    532
#define SSP2STAT_P                    533
#define SSP2STAT_D_nA                 534
#define SSP2STAT_CKE                  535
#define SSP2STAT_SMP                  536
#define SSP2CON1                      537
#define SSP2CON1_SSPM                 538
#define SSP2CON1_SSPM0                539
#define SSP2CON1_SSPM1                540
#define SSP2CON1_SSPM2                541
#define SSP2CON1_SSPM3                542
#define SSP2CON1_CKP                  543
#define SSP2CON1_SSPEN                544
#define SSP2CON1_SSPOV                545
#define SSP2CON1_WCOL                 546
#define SSP2CON2                      547
#define SSP2CON2_SEN                  548
#define SSP2CON2_RSEN                 549
#define SSP2CON2_PEN                  550
#define SSP2CON2_RCEN                 551
#define SSP2CON2_ACKEN                552
#define SSP2CON2_ACKDT                553
#define SSP2CON2_ACKSTAT              554
#define SSP2CON2_GCEN                 555
#define SSP2CON3                      556
#define SSP2CON3_DHEN                 557
#define SSP2CON3_AHEN                 558
#define SSP2CON3_SBCDE                559
#define SSP2CON3_SDAHT                560
#define SSP2CON3_BOEN                 561
#define SSP2CON3_SCIE                 562
#define SSP2CON3_PCIE                 563
#define SSP2CON3_ACKTIM               564
#define ODCONA                        565
#define ODCA0                         566
#define ODCA1                         567
#define ODCA2                         568
#define ODCA4                         569
#define ODCA5                         570
#define ODCONC                        571
#define ODCC0                         572
#define ODCC1                         573
#define ODCC2                         574
#define ODCC3                         575
#define ODCC4                         576
#define ODCC5                         577
#define CCPR1L                        578
#define CCPR1H                        579
#define CCP1CON                       580
#define CCP1MODE                      581
#define CCP1MODE0                     582
#define CCP1MODE1                     583
#define CCP1MODE2                     584
#define CCP1MODE3                     585
#define CCP1FMT                       586
#define CCP1OUT                       587
#define CCP1EN                        588
#define CCP1CAP                       589
#define CCP1CTS                       590
#define CCP1CTS0                      591
#define CCP1CTS1                      592
#define CCP1CTS2                      593
#define CCP1CTS3                      594
#define CCPR2L                        595
#define CCPR2H                        596
#define CCP2CON                       597
#define CCP2MODE                      598
#define CCP2MODE0                     599
#define CCP2MODE1                     600
#define CCP2MODE2                     601
#define CCP2MODE3                     602
#define CCP2FMT                       603
#define CCP2OUT                       604
#define CCP2EN                        605
#define CCP2CAP                       606
#define CCP2CTS                       607
#define CCP2CTS0                      608
#define CCP2CTS1                      609
#define CCP2CTS2                      610
#define CCP2CTS3                      611
#define CCPTMRS                       612
#define C1TSEL0                       613
#define C1TSEL                        614
#define C1TSEL1                       615
#define C2TSEL0                       616
#define C2TSEL                        617
#define C2TSEL1                       618
#define C3TSEL0                       619
#define C3TSEL                        620
#define C3TSEL1                       621
#define C4TSEL                        622
#define C4TSEL0                       623
#define C4TSEL1                       624
#define SLRCONA                       625
#define SLRA0                         626
#define SLRA1                         627
#define SLRA2                         628
#define SLRA4                         629
#define SLRA5                         630
#define SLRCONC                       631
#define SLRC0                         632
#define SLRC1                         633
#define SLRC2                         634
#define SLRC3                         635
#define SLRC4                         636
#define SLRC5                         637
#define CCPR3L                        638
#define CCPR3H                        639
#define CCP3CON                       640
#define CCP3MODE0                     641
#define CCP3MODE                      642
#define CCP3MODE1                     643
#define CCP3MODE2                     644
#define CCP3MODE3                     645
#define CCP3FMT                       646
#define CCP3OUT                       647
#define CCP3EN                        648
#define CCP3CAP                       649
#define CCP3CTS                       650
#define CCP3CTS0                      651
#define CCP3CTS1                      652
#define CCP3CTS2                      653
#define CCP3CTS3                      654
#define CCPR4L                        655
#define CCPR4H                        656
#define CCP4CON                       657
#define CCP4MODE                      658
#define CCP4MODE0                     659
#define CCP4MODE1                     660
#define CCP4MODE2                     661
#define CCP4MODE3                     662
#define CCP4FMT                       663
#define CCP4OUT                       664
#define CCP4EN                        665
#define CCP4CAP                       666
#define CCP4CTS                       667
#define CCP4CTS0                      668
#define CCP4CTS1                      669
#define CCP4CTS2                      670
#define CCP4CTS3                      671
#define INLVLA                        672
#define INLVLA0                       673
#define INLVLA1                       674
#define INLVLA2                       675
#define INLVLA3                       676
#define INLVLA4                       677
#define INLVLA5                       678
#define INLVLC                        679
#define INLVLC0                       680
#define INLVLC1                       681
#define INLVLC2                       682
#define INLVLC3                       683
#define INLVLC4                       684
#define INLVLC5                       685
#define IOCAP                         686
#define IOCAP0                        687
#define IOCAP1                        688
#define IOCAP2                        689
#define IOCAP3                        690
#define IOCAP4                        691
#define IOCAP5                        692
#define IOCAN                         693
#define IOCAN0                        694
#define IOCAN1                        695
#define IOCAN2                        696
#define IOCAN3                        697
#define IOCAN4                        698
#define IOCAN5                        699
#define IOCAF                         700
#define IOCAF0                        701
#define IOCAF1                        702
#define IOCAF2                        703
#define IOCAF3                        704
#define IOCAF4                        705
#define IOCAF5                        706
#define IOCCP                         707
#define IOCCP0                        708
#define IOCCP1                        709
#define IOCCP2                        710
#define IOCCP3                        711
#define IOCCP4                        712
#define IOCCP5                        713
#define IOCCN                         714
#define IOCCN0                        715
#define IOCCN1                        716
#define IOCCN2                        717
#define IOCCN3                        718
#define IOCCN4                        719
#define IOCCN5                        720
#define IOCCF                         721
#define IOCCF0                        722
#define IOCCF1                        723
#define IOCCF2                        724
#define IOCCF3                        725
#define IOCCF4                        726
#define IOCCF5                        727
#define CLKRCON                       728
#define CLKRDIV                       729
#define CLKRDIV0                      730
#define CLKRDIV1                      731
#define CLKRDIV2                      732
#define CLKRDC                        733
#define CLKRDC0                       734
#define CLKRDC1                       735
#define CLKREN                        736
#define MDCON                         737
#define MDBIT                         738
#define MDOUT                         739
#define MDOPOL                        740
#define MDEN                          741
#define MDSRC                         742
#define MDMS0                         743
#define MDMS                          744
#define MDMS1                         745
#define MDMS2                         746
#define MDMS3                         747
#define MDCARH                        748
#define MDCH                          749
#define MDCH0                         750
#define MDCH1                         751
#define MDCH2                         752
#define MDCH3                         753
#define MDCHSYNC                      754
#define MDCHPOL                       755
#define MDCARL                        756
#define MDCL0                         757
#define MDCL                          758
#define MDCL1                         759
#define MDCL2                         760
#define MDCL3                         761
#define MDCLSYNC                      762
#define MDCLPOL                       763
#define CCDNA                         764
#define CCDNA0                        765
#define CCDNA1                        766
#define CCDNA2                        767
#define CCDNA4                        768
#define CCDNA5                        769
#define CCDNC                         770
#define CCDNC0                        771
#define CCDNC1                        772
#define CCDNC2                        773
#define CCDNC3                        774
#define CCDNC4                        775
#define CCDNC5                        776
#define TMR3L                         777
#define TMR3H                         778
#define T3CON                         779
#define TMR3ON                        780
#define T3SYNC                        781
#define T3SOSC                        782
#define T3CKPS                        783
#define T3CKPS0                       784
#define T3CKPS1                       785
#define TMR3CS0                       786
#define TMR3CS                        787
#define TMR3CS1                       788
#define T3GCON                        789
#define T3GSS0                        790
#define T3GSS                         791
#define T3GSS1                        792
#define T3GVAL                        793
#define T3GGO_nDONE                   794
#define T3GSPM                        795
#define T3GTM                         796
#define T3GPOL                        797
#define TMR3GE                        798
#define TMR4                          799
#define PR4                           800
#define T4CON                         801
#define T4CKPS0                       802
#define T4CKPS                        803
#define T4CKPS1                       804
#define TMR4ON                        805
#define T4OUTPS                       806
#define T4OUTPS0                      807
#define T4OUTPS1                      808
#define T4OUTPS2                      809
#define T4OUTPS3                      810
#define TMR5L                         811
#define TMR5H                         812
#define T5CON                         813
#define TMR5ON                        814
#define T5SYNC                        815
#define T5SOSC                        816
#define T5CKPS                        817
#define T5CKPS0                       818
#define T5CKPS1                       819
#define TMR5CS0                       820
#define TMR5CS                        821
#define TMR5CS1                       822
#define T5GCON                        823
#define T5GSS                         824
#define T5GSS0                        825
#define T5GSS1                        826
#define T5GVAL                        827
#define T5GGO_nDONE                   828
#define T5GSPM                        829
#define T5GTM                         830
#define T5GPOL                        831
#define TMR5GE                        832
#define TMR6                          833
#define PR6                           834
#define T6CON                         835
#define T6CKPS0                       836
#define T6CKPS                        837
#define T6CKPS1                       838
#define TMR6ON                        839
#define T6OUTPS0                      840
#define T6OUTPS                       841
#define T6OUTPS1                      842
#define T6OUTPS2                      843
#define T6OUTPS3                      844
#define CCDCON                        845
#define CCDS                          846
#define CCDS0                         847
#define CCDS1                         848
#define CCDEN                         849
#define CCDPA                         850
#define CCDPA0                        851
#define CCDPA1                        852
#define CCDPA2                        853
#define CCDPA4                        854
#define CCDPA5                        855
#define CCDPC                         856
#define CCDPC0                        857
#define CCDPC1                        858
#define CCDPC2                        859
#define CCDPC3                        860
#define CCDPC4                        861
#define CCDPC5                        862
#define NCO1ACCL                      863
#define NCO1ACCL_NCO1ACC              864
#define NCO1ACCH                      865
#define NCO1ACCH_NCO1ACC              866
#define NCO1ACCU                      867
#define NCO1ACCU_NCO1ACC              868
#define NCO1INCL                      869
#define NCO1INCL_NCO1INC              870
#define NCO1INCH                      871
#define NCO1INCH_NCO1INC              872
#define NCO1INCU                      873
#define NCO1INCU_NCO1INC              874
#define NCO1CON                       875
#define N1PFM                         876
#define N1POL                         877
#define N1OUT                         878
#define N1EN                          879
#define NCO1CLK                       880
#define N1CKS                         881
#define N1PWS                         882
#define PWM5DCL                       883
#define PWM5DCL0                      884
#define PWM5DCL1                      885
#define PWM5DCH                       886
#define PWM5DCH0                      887
#define PWM5DCH1                      888
#define PWM5DCH2                      889
#define PWM5DCH3                      890
#define PWM5DCH4                      891
#define PWM5DCH5                      892
#define PWM5DCH6                      893
#define PWM5DCH7                      894
#define PWM5CON                       895
#define PWM5POL                       896
#define PWM5OUT                       897
#define PWM5EN                        898
#define PWM6DCL                       899
#define PWM6DCL0                      900
#define PWM6DCL1                      901
#define PWM6DCH                       902
#define PWM6DCH0                      903
#define PWM6DCH1                      904
#define PWM6DCH2                      905
#define PWM6DCH3                      906
#define PWM6DCH4                      907
#define PWM6DCH5                      908
#define PWM6DCH6                      909
#define PWM6DCH7                      910
#define PWM6CON                       911
#define PWM6POL                       912
#define PWM6OUT                       913
#define PWM6EN                        914
#define PWMTMRS                       915
#define P5TSEL                        916
#define P5TSEL0                       917
#define P5TSEL1                       918
#define P6TSEL0                       919
#define P6TSEL                        920
#define P6TSEL1                       921
#define CWG1CLKCON                    922
#define CWG1CLKCON_CS                 923
#define CWG1CS                        924
#define CWG1DAT                       925
#define CWG1DAT_DAT                   926
#define CWG1DAT0                      927
#define CWG1DAT1                      928
#define CWG1DAT2                      929
#define CWG1DAT3                      930
#define CWG1DBR_DBR                   931
#define CWG1DBR0                      932
#define CWG1DBR_DBR0                  933
#define CWG1DBR                       934
#define CWG1DBR1                      935
#define CWG1DBR_DBR1                  936
#define CWG1DBR2                      937
#define CWG1DBR_DBR2                  938
#define CWG1DBR3                      939
#define CWG1DBR_DBR3                  940
#define CWG1DBR_DBR4                  941
#define CWG1DBR4                      942
#define CWG1DBR5                      943
#define CWG1DBR_DBR5                  944
#define CWG1DBF                       945
#define CWG1DBF0                      946
#define CWG1DBF_DBF                   947
#define CWG1DBF_DBF0                  948
#define CWG1DBF1                      949
#define CWG1DBF_DBF1                  950
#define CWG1DBF_DBF2                  951
#define CWG1DBF2                      952
#define CWG1DBF3                      953
#define CWG1DBF_DBF3                  954
#define CWG1DBF_DBF4                  955
#define CWG1DBF4                      956
#define CWG1DBF_DBF5                  957
#define CWG1DBF5                      958
#define CWG1CON0                      959
#define CWG1MODE0                     960
#define CWG1CON0_MODE                 961
#define CWG1CON0_MODE0                962
#define CWG1MODE                      963
#define CWG1MODE1                     964
#define CWG1CON0_MODE1                965
#define CWG1MODE2                     966
#define CWG1CON0_MODE2                967
#define CWG1CON0_LD                   968
#define CWG1LD                        969
#define CWG1EN                        970
#define G1EN                          971
#define CWG1CON0_EN                   972
#define CWG1CON1                      973
#define CWG1POLA                      974
#define CWG1CON1_POLA                 975
#define CWG1CON1_POLB                 976
#define CWG1POLB                      977
#define CWG1POLC                      978
#define CWG1CON1_POLC                 979
#define CWG1CON1_POLD                 980
#define CWG1POLD                      981
#define CWG1CON1_IN                   982
#define CWG1IN                        983
#define CWG1AS0                       984
#define CWG1LSAC                      985
#define CWG1AS0_LSAC0                 986
#define CWG1AS0_LSAC                  987
#define CWG1LSAC0                     988
#define CWG1AS0_LSAC1                 989
#define CWG1LSAC1                     990
#define CWG1AS0_LSBD0                 991
#define CWG1LSBD0                     992
#define CWG1LSBD                      993
#define CWG1AS0_LSBD                  994
#define CWG1LSBD1                     995
#define CWG1AS0_LSBD1                 996
#define CWG1AS0_REN                   997
#define CWG1REN                       998
#define CWG1AS0_SHUTDOWN              999
#define CWG1SHUTDOWN                  1000
#define CWG1AS1                       1001
#define CWG1AS1_AS0E                  1002
#define CWG1AS1_AS1E                  1003
#define CWG1AS1_AS2E                  1004
#define CWG1AS1_AS3E                  1005
#define CWG1AS1_AS4E                  1006
#define CWG1STR                       1007
#define CWG1STRA                      1008
#define CWG1STR_STRA                  1009
#define CWG1STRB                      1010
#define CWG1STR_STRB                  1011
#define CWG1STRC                      1012
#define CWG1STR_STRC                  1013
#define CWG1STR_STRD                  1014
#define CWG1STRD                      1015
#define CWG1OVRA                      1016
#define CWG1STR_OVRA                  1017
#define CWG1OVRB                      1018
#define CWG1STR_OVRB                  1019
#define CWG1OVRC                      1020
#define CWG1STR_OVRC                  1021
#define CWG1OVRD                      1022
#define CWG1STR_OVRD                  1023
#define CWG2CLKCON                    1024
#define CWG2CS                        1025
#define CWG2CLKCON_CS                 1026
#define CWG2DAT                       1027
#define CWG2DAT0                      1028
#define CWG2DAT_DAT                   1029
#define CWG2DAT1                      1030
#define CWG2DAT2                      1031
#define CWG2DAT3                      1032
#define CWG2DBR_DBR                   1033
#define CWG2DBR_DBR0                  1034
#define CWG2DBR                       1035
#define CWG2DBR0                      1036
#define CWG2DBR_DBR1                  1037
#define CWG2DBR1                      1038
#define CWG2DBR_DBR2                  1039
#define CWG2DBR2                      1040
#define CWG2DBR_DBR3                  1041
#define CWG2DBR3                      1042
#define CWG2DBR_DBR4                  1043
#define CWG2DBR4                      1044
#define CWG2DBR_DBR5                  1045
#define CWG2DBR5                      1046
#define CWG2DBF                       1047
#define CWG2DBF_DBF0                  1048
#define CWG2DBF_DBF                   1049
#define CWG2DBF0                      1050
#define CWG2DBF_DBF1                  1051
#define CWG2DBF1                      1052
#define CWG2DBF_DBF2                  1053
#define CWG2DBF2                      1054
#define CWG2DBF_DBF3                  1055
#define CWG2DBF3                      1056
#define CWG2DBF_DBF4                  1057
#define CWG2DBF4                      1058
#define CWG2DBF5                      1059
#define CWG2DBF_DBF5                  1060
#define CWG2CON0                      1061
#define CWG2MODE                      1062
#define CWG2MODE0                     1063
#define CWG2CON0_MODE                 1064
#define CWG2CON0_MODE0                1065
#define CWG2MODE1                     1066
#define CWG2CON0_MODE1                1067
#define CWG2MODE2                     1068
#define CWG2CON0_MODE2                1069
#define CWG2LD                        1070
#define CWG2CON0_LD                   1071
#define CWG2CON0_EN                   1072
#define CWG2EN                        1073
#define G2EN                          1074
#define CWG2CON1                      1075
#define CWG2POLA                      1076
#define CWG2CON1_POLA                 1077
#define CWG2POLB                      1078
#define CWG2CON1_POLB                 1079
#define CWG2POLC                      1080
#define CWG2CON1_POLC                 1081
#define CWG2CON1_POLD                 1082
#define CWG2POLD                      1083
#define CWG2IN                        1084
#define CWG2CON1_IN                   1085
#define CWG2AS0                       1086
#define CWG2LSAC                      1087
#define CWG2AS0_LSAC                  1088
#define CWG2LSAC0                     1089
#define CWG2AS0_LSAC0                 1090
