tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18326_tdd.h
#define CWG2LSAC1                     1091
#define CWG2AS0_LSAC1                 1092
#define CWG2AS0_LSBD0                 1093
#define CWG2LSBD                      1094
#define CWG2AS0_LSBD                  1095
#define CWG2LSBD0                     1096
#define CWG2AS0_LSBD1                 1097
#define CWG2LSBD1                     1098
#define CWG2AS0_REN                   1099
#define CWG2REN                       1100
#define CWG2AS0_SHUTDOWN              1101
#define CWG2SHUTDOWN                  1102
#define CWG2AS1                       1103
#define CWG2AS1_AS0E                  1104
#define CWG2AS1_AS1E                  1105
#define CWG2AS1_AS2E                  1106
#define CWG2AS1_AS3E                  1107
#define CWG2AS1_AS4E                  1108
#define CWG2STR                       1109
#define CWG2STR_STRA                  1110
#define CWG2STRA                      1111
#define CWG2STR_STRB                  1112
#define CWG2STRB                      1113
#define CWG2STR_STRC                  1114
#define CWG2STRC                      1115
#define CWG2STR_STRD                  1116
#define CWG2STRD                      1117
#define CWG2STR_OVRA                  1118
#define CWG2OVRA                      1119
#define CWG2OVRB                      1120
#define CWG2STR_OVRB                  1121
#define CWG2STR_OVRC                  1122
#define CWG2OVRC                      1123
#define CWG2OVRD                      1124
#define CWG2STR_OVRD                  1125
#define NVMADR0                       1126
#define NVMADRL                       1127
#define NVMADR1                       1128
#define NVMADR2                       1129
#define NVMADR3                       1130
#define NVMADR4                       1131
#define NVMADR5                       1132
#define NVMADR6                       1133
#define NVMADR7                       1134
#define NVMADR8                       1135
#define NVMADRH                       1136
#define NVMADR9                       1137
#define NVMADR10                      1138
#define NVMADR11                      1139
#define NVMADR12                      1140
#define NVMADR13                      1141
#define NVMADR14                      1142
#define NVMDAT0                       1143
#define NVMDATL                       1144
#define NVMDAT1                       1145
#define NVMDAT2                       1146
#define NVMDAT3                       1147
#define NVMDAT4                       1148
#define NVMDAT5                       1149
#define NVMDAT6                       1150
#define NVMDAT7                       1151
#define NVMDAT8                       1152
#define NVMDATH                       1153
#define NVMDAT9                       1154
#define NVMDAT10                      1155
#define NVMDAT11                      1156
#define NVMDAT12                      1157
#define NVMDAT13                      1158
#define NVMCON1                       1159
#define RD                            1160
#define WR                            1161
#define WREN                          1162
#define WRERR                         1163
#define FREE                          1164
#define LWLO                          1165
#define NVMREGS                       1166
#define NVMCON2                       1167
#define NMVCON2                       1168
#define PCON0                         1169
#define nBOR                          1170
#define nPOR                          1171
#define nRI                           1172
#define nRMCLR                        1173
#define nRWDT                         1174
#define STKUNF                        1175
#define STKOVF                        1176
#define PMD0                          1177
#define IOCMD                         1178
#define CLKRMD                        1179
#define NVMMD                         1180
#define FVRMD                         1181
#define SYSCMD                        1182
#define PMD1                          1183
#define TMR0MD                        1184
#define TMR1MD                        1185
#define TMR2MD                        1186
#define TMR3MD                        1187
#define TMR4MD                        1188
#define TMR5MD                        1189
#define TMR6MD                        1190
#define NCOMD                         1191
#define PMD2                          1192
#define CMP1MD                        1193
#define CMP2MD                        1194
#define ADCMD                         1195
#define DACMD                         1196
#define PMD3                          1197
#define CCP1MD                        1198
#define CCP2MD                        1199
#define CCP3MD                        1200
#define CCP4MD                        1201
#define PWM5MD                        1202
#define PWM6MD                        1203
#define CWG1MD                        1204
#define CWG2MD                        1205
#define PMD4                          1206
#define MSSP1MD                       1207
#define MSSP2MD                       1208
#define UART1MD                       1209
#define PMD5                          1210
#define DSMMD                         1211
#define CLC1MD                        1212
#define CLC2MD                        1213
#define CLC3MD                        1214
#define CLC4MD                        1215
#define CPUDOZE                       1216
#define DOZE0                         1217
#define DOZE                          1218
#define DOZE1                         1219
#define DOZE2                         1220
#define DOE                           1221
#define ROI                           1222
#define DOZEN                         1223
#define IDLEN                         1224
#define OSCCON1                       1225
#define NDIV0                         1226
#define NDIV                          1227
#define NDIV1                         1228
#define NDIV2                         1229
#define NDIV3                         1230
#define NOSC0                         1231
#define NOSC                          1232
#define NOSC1                         1233
#define NOSC2                         1234
#define OSCCON2                       1235
#define CDIV0                         1236
#define CDIV                          1237
#define CDIV1                         1238
#define CDIV2                         1239
#define CDIV3                         1240
#define COSC                          1241
#define COSC0                         1242
#define COSC1                         1243
#define COSC2                         1244
#define OSCCON3                       1245
#define NOSCR                         1246
#define ORDY                          1247
#define SOSCBE                        1248
#define SOSCPWR                       1249
#define CSWHOLD                       1250
#define OSCSTAT1                      1251
#define PLLR                          1252
#define ADOR                          1253
#define SOR                           1254
#define LFOR                          1255
#define HFOR                          1256
#define EXTOR                         1257
#define OSCEN                         1258
#define ADOEN                         1259
#define SOSCEN                        1260
#define LFOEN                         1261
#define HFOEN                         1262
#define EXTOEN                        1263
#define OSCTUNE                       1264
#define HFTUN0                        1265
#define HFTUN                         1266
#define HFTUN1                        1267
#define HFTUN2                        1268
#define HFTUN3                        1269
#define HFTUN4                        1270
#define HFTUN5                        1271
#define OSCFRQ                        1272
#define HFFRQ                         1273
#define HFFRQ0                        1274
#define HFFRQ1                        1275
#define HFFRQ2                        1276
#define HFFRQ3                        1277
#define PPSLOCK                       1278
#define PPSLOCKED                     1279
#define INTPPS0                       1280
#define INTPPS                        1281
#define INTPPS1                       1282
#define INTPPS2                       1283
#define INTPPS3                       1284
#define INTPPS4                       1285
#define T0CKIPPS0                     1286
#define T0CKIPPS                      1287
#define T0CKIPPS1                     1288
#define T0CKIPPS2                     1289
#define T0CKIPPS3                     1290
#define T0CKIPPS4                     1291
#define T1CKIPPS0                     1292
#define T1CKIPPS                      1293
#define T1CKIPPS1                     1294
#define T1CKIPPS2                     1295
#define T1CKIPPS3                     1296
#define T1CKIPPS4                     1297
#define T1GPPS0                       1298
#define T1GPPS                        1299
#define T1GPPS1                       1300
#define T1GPPS2                       1301
#define T1GPPS3                       1302
#define T1GPPS4                       1303
#define CCP1PPS0                      1304
#define CCP1PPS                       1305
#define CCP1PPS1                      1306
#define CCP1PPS2                      1307
#define CCP1PPS3                      1308
#define CCP1PPS4                      1309
#define CCP2PPS0                      1310
#define CCP2PPS                       1311
#define CCP2PPS1                      1312
#define CCP2PPS2                      1313
#define CCP2PPS3                      1314
#define CCP2PPS4                      1315
#define CCP3PPS0                      1316
#define CCP3PPS                       1317
#define CCP3PPS1                      1318
#define CCP3PPS2                      1319
#define CCP3PPS3                      1320
#define CCP3PPS4                      1321
#define CCP4PPS0                      1322
#define CCP4PPS                       1323
#define CCP4PPS1                      1324
#define CCP4PPS2                      1325
#define CCP4PPS3                      1326
#define CCP4PPS4                      1327
#define CWG1PPS0                      1328
#define CWG1PPS                       1329
#define CWG1PPS1                      1330
#define CWG1PPS2                      1331
#define CWG1PPS3                      1332
#define CWG1PPS4                      1333
#define CWG2PPS0                      1334
#define CWG2PPS                       1335
#define CWG2PPS1                      1336
#define CWG2PPS2                      1337
#define CWG2PPS3                      1338
#define CWG2PPS4                      1339
#define MDCIN1PPS                     1340
#define MDCIN1PPS0                    1341
#define MDCIN1PPS1                    1342
#define MDCIN1PPS2                    1343
#define MDCIN1PPS3                    1344
#define MDCIN1PPS4                    1345
#define MDCIN2PPS0                    1346
#define MDCIN2PPS                     1347
#define MDCIN2PPS1                    1348
#define MDCIN2PPS2                    1349
#define MDCIN2PPS3                    1350
#define MDCIN2PPS4                    1351
#define MDMINPPS                      1352
#define MDMINPPS0                     1353
#define MDMINPPS1                     1354
#define MDMINPPS2                     1355
#define MDMINPPS3                     1356
#define MDMINPPS4                     1357
#define SSP2CLKPPS                    1358
#define SSP2CLKPPS0                   1359
#define SSP2CLKPPS1                   1360
#define SSP2CLKPPS2                   1361
#define SSP2CLKPPS3                   1362
#define SSP2CLKPPS4                   1363
#define SSP2DATPPS                    1364
#define SSP2DATPPS0                   1365
#define SSP2DATPPS1                   1366
#define SSP2DATPPS2                   1367
#define SSP2DATPPS3                   1368
#define SSP2DATPPS4                   1369
#define SSP2SSPPS                     1370
#define SSP2SSPPS0                    1371
#define SSP2SSPPS1                    1372
#define SSP2SSPPS2                    1373
#define SSP2SSPPS3                    1374
#define SSP2SSPPS4                    1375
#define SSP1CLKPPS0                   1376
#define SSP1CLKPPS                    1377
#define SSP1CLKPPS1                   1378
#define SSP1CLKPPS2                   1379
#define SSP1CLKPPS3                   1380
#define SSP1CLKPPS4                   1381
#define SSP1DATPPS0                   1382
#define SSP1DATPPS                    1383
#define SSP1DATPPS1                   1384
#define SSP1DATPPS2                   1385
#define SSP1DATPPS3                   1386
#define SSP1DATPPS4                   1387
#define SSP1SSPPS                     1388
#define SSP1SSPPS0                    1389
#define SSP1SSPPS1                    1390
#define SSP1SSPPS2                    1391
#define SSP1SSPPS3                    1392
#define SSP1SSPPS4                    1393
#define RXPPS                         1394
#define RXDTPPS0                      1395
#define RXDTPPS1                      1396
#define RXDTPPS2                      1397
#define RXDTPPS3                      1398
#define RXDTPPS4                      1399
#define TXCKPPS0                      1400
#define TXPPS                         1401
#define TXCKPPS1                      1402
#define TXCKPPS2                      1403
#define TXCKPPS3                      1404
#define TXCKPPS4                      1405
#define CLCIN0PPS                     1406
#define CLCIN0PPS0                    1407
#define CLCIN0PPS1                    1408
#define CLCIN0PPS2                    1409
#define CLCIN0PPS3                    1410
#define CLCIN0PPS4                    1411
#define CLCIN1PPS0                    1412
#define CLCIN1PPS                     1413
#define CLCIN1PPS1                    1414
#define CLCIN1PPS2                    1415
#define CLCIN1PPS3                    1416
#define CLCIN1PPS4                    1417
#define CLCIN2PPS                     1418
#define CLCIN2PPS0                    1419
#define CLCIN2PPS1                    1420
#define CLCIN2PPS2                    1421
#define CLCIN2PPS3                    1422
#define CLCIN2PPS4                    1423
#define CLCIN3PPS                     1424
#define CLCIN3PPS0                    1425
#define CLCIN3PPS1                    1426
#define CLCIN3PPS2                    1427
#define CLCIN3PPS3                    1428
#define CLCIN3PPS4                    1429
#define T3CKIPPS                      1430
#define T3GPPS                        1431
#define T5CKIPPS                      1432
#define T5GPPS                        1433
#define RA0PPS                        1434
#define RA0PPS0                       1435
#define RA0PPS1                       1436
#define RA0PPS2                       1437
#define RA0PPS3                       1438
#define RA0PPS4                       1439
#define RA1PPS                        1440
#define RA1PPS0                       1441
#define RA1PPS1                       1442
#define RA1PPS2                       1443
#define RA1PPS3                       1444
#define RA1PPS4                       1445
#define RA2PPS0                       1446
#define RA2PPS                        1447
#define RA2PPS1                       1448
#define RA2PPS2                       1449
#define RA2PPS3                       1450
#define RA2PPS4                       1451
#define RA4PPS                        1452
#define RA4PPS0                       1453
#define RA4PPS1                       1454
#define RA4PPS2                       1455
#define RA4PPS3                       1456
#define RA4PPS4                       1457
#define RA5PPS                        1458
#define RA5PPS0                       1459
#define RA5PPS1                       1460
#define RA5PPS2                       1461
#define RA5PPS3                       1462
#define RA5PPS4                       1463
#define RC0PPS                        1464
#define RC0PPS0                       1465
#define RC0PPS1                       1466
#define RC0PPS2                       1467
#define RC0PPS3                       1468
#define RC0PPS4                       1469
#define RC1PPS0                       1470
#define RC1PPS                        1471
#define RC1PPS1                       1472
#define RC1PPS2                       1473
#define RC1PPS3                       1474
#define RC1PPS4                       1475
#define RC2PPS                        1476
#define RC2PPS0                       1477
#define RC2PPS1                       1478
#define RC2PPS2                       1479
#define RC2PPS3                       1480
#define RC2PPS4                       1481
#define RC3PPS                        1482
#define RC3PPS0                       1483
#define RC3PPS1                       1484
#define RC3PPS2                       1485
#define RC3PPS3                       1486
#define RC3PPS4                       1487
#define RC4PPS0                       1488
#define RC4PPS                        1489
#define RC4PPS1                       1490
#define RC4PPS2                       1491
#define RC4PPS3                       1492
#define RC4PPS4                       1493
#define RC5PPS0                       1494
#define RC5PPS                        1495
#define RC5PPS1                       1496
#define RC5PPS2                       1497
#define RC5PPS3                       1498
#define RC5PPS4                       1499
#define CLCDATA                       1500
#define MLC1OUT                       1501
#define MLC2OUT                       1502
#define MLC3OUT                       1503
#define MLC4OUT                       1504
#define CLC1CON                       1505
#define CLC1CON_MODE0                 1506
#define LC1MODE                       1507
#define CLC1CON_MODE                  1508
#define LC1MODE0                      1509
#define CLC1CON_MODE1                 1510
#define LC1MODE1                      1511
#define LC1MODE2                      1512
#define CLC1CON_MODE2                 1513
#define LC1INTN                       1514
#define CLC1CON_INTN                  1515
#define CLC1CON_INTP                  1516
#define LC1INTP                       1517
#define LC1OUT                        1518
#define CLC1CON_OUT                   1519
#define CLC1CON_EN                    1520
#define LC1EN                         1521
#define CLC1POL                       1522
#define LC1G1POL                      1523
#define CLC1POL_G1POL                 1524
#define CLC1POL_G2POL                 1525
#define LC1G2POL                      1526
#define LC1G3POL                      1527
#define CLC1POL_G3POL                 1528
#define LC1G4POL                      1529
#define CLC1POL_G4POL                 1530
#define CLC1POL_POL                   1531
#define LC1POL                        1532
#define CLC1SEL0                      1533
#define CLC1SEL0_D1S0                 1534
#define LC1D1S0                       1535
#define CLC1SEL0_D1S                  1536
#define LC1D1S                        1537
#define CLC1SEL0_D1S1                 1538
#define LC1D1S1                       1539
#define CLC1SEL0_D1S2                 1540
#define LC1D1S2                       1541
#define LC1D1S3                       1542
#define CLC1SEL0_D1S3                 1543
#define CLC1SEL0_D1S4                 1544
#define LC1D1S4                       1545
#define CLC1SEL0_D1S5                 1546
#define LC1D1S5                       1547
#define CLC1SEL1                      1548
#define CLC1SEL1_D2S0                 1549
#define CLC1SEL1_D2S                  1550
#define LC1D2S                        1551
#define LC1D2S0                       1552
#define CLC1SEL1_D2S1                 1553
#define LC1D2S1                       1554
#define CLC1SEL1_D2S2                 1555
#define LC1D2S2                       1556
#define LC1D2S3                       1557
#define CLC1SEL1_D2S3                 1558
#define LC1D2S4                       1559
#define CLC1SEL1_D2S4                 1560
#define LC1D2S5                       1561
#define CLC1SEL1_D2S5                 1562
#define CLC1SEL2                      1563
#define LC1D3S0                       1564
#define CLC1SEL2_D3S                  1565
#define LC1D3S                        1566
#define CLC1SEL2_D3S0                 1567
#define LC1D3S1                       1568
#define CLC1SEL2_D3S1                 1569
#define LC1D3S2                       1570
#define CLC1SEL2_D3S2                 1571
#define LC1D3S3                       1572
#define CLC1SEL2_D3S3                 1573
#define LC1D3S4                       1574
#define CLC1SEL2_D3S4                 1575
#define LC1D3S5                       1576
#define CLC1SEL2_D3S5                 1577
#define CLC1SEL3                      1578
#define CLC1SEL3_D4S                  1579
#define LC1D4S                        1580
#define LC1D4S0                       1581
#define CLC1SEL3_D4S0                 1582
#define CLC1SEL3_D4S1                 1583
#define LC1D4S1                       1584
#define LC1D4S2                       1585
#define CLC1SEL3_D4S2                 1586
#define LC1D4S3                       1587
#define CLC1SEL3_D4S3                 1588
#define LC1D4S4                       1589
#define CLC1SEL3_D4S4                 1590
#define LC1D4S5                       1591
#define CLC1SEL3_D4S5                 1592
#define CLC1GLS0                      1593
#define CLC1GLS0_D1N                  1594
#define LC1G1D1N                      1595
#define CLC1GLS0_D1T                  1596
#define LC1G1D1T                      1597
#define LC1G1D2N                      1598
#define CLC1GLS0_D2N                  1599
#define LC1G1D2T                      1600
#define CLC1GLS0_D2T                  1601
#define CLC1GLS0_D3N                  1602
#define LC1G1D3N                      1603
#define CLC1GLS0_D3T                  1604
#define LC1G1D3T                      1605
#define CLC1GLS0_D4N                  1606
#define LC1G1D4N                      1607
#define CLC1GLS0_D4T                  1608
#define LC1G1D4T                      1609
#define CLC1GLS1                      1610
#define CLC1GLS1_D1N                  1611
#define LC1G2D1N                      1612
#define LC1G2D1T                      1613
#define CLC1GLS1_D1T                  1614
#define CLC1GLS1_D2N                  1615
#define LC1G2D2N                      1616
#define LC1G2D2T                      1617
#define CLC1GLS1_D2T                  1618
#define CLC1GLS1_D3N                  1619
#define LC1G2D3N                      1620
#define LC1G2D3T                      1621
#define CLC1GLS1_D3T                  1622
#define CLC1GLS1_D4N                  1623
#define LC1G2D4N                      1624
#define LC1G2D4T                      1625
#define CLC1GLS1_D4T                  1626
#define CLC1GLS2                      1627
#define CLC1GLS2_D1N                  1628
#define LC1G3D1N                      1629
#define LC1G3D1T                      1630
#define CLC1GLS2_D1T                  1631
#define LC1G3D2N                      1632
#define CLC1GLS2_D2N                  1633
#define LC1G3D2T                      1634
#define CLC1GLS2_D2T                  1635
#define CLC1GLS2_D3N                  1636
#define LC1G3D3N                      1637
#define LC1G3D3T                      1638
#define CLC1GLS2_D3T                  1639
#define LC1G3D4N                      1640
#define CLC1GLS2_D4N                  1641
#define LC1G3D4T                      1642
#define CLC1GLS2_D4T                  1643
#define CLC1GLS3                      1644
#define LC1G4D1N                      1645
#define CLC1GLS3_G4D1N                1646
#define LC1G4D1T                      1647
#define CLC1GLS3_G4D1T                1648
