tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18326_tdd.h
#define CLC1GLS3_G4D2N                1649
#define LC1G4D2N                      1650
#define CLC1GLS3_G4D2T                1651
#define LC1G4D2T                      1652
#define LC1G4D3N                      1653
#define CLC1GLS3_G4D3N                1654
#define LC1G4D3T                      1655
#define CLC1GLS3_G4D3T                1656
#define CLC1GLS3_G4D4N                1657
#define LC1G4D4N                      1658
#define CLC1GLS3_G4D4T                1659
#define LC1G4D4T                      1660
#define CLC2CON                       1661
#define LC2MODE0                      1662
#define CLC2CON_MODE                  1663
#define LC2MODE                       1664
#define CLC2CON_MODE0                 1665
#define LC2MODE1                      1666
#define CLC2CON_MODE1                 1667
#define LC2MODE2                      1668
#define CLC2CON_MODE2                 1669
#define LC2INTN                       1670
#define CLC2CON_INTN                  1671
#define LC2INTP                       1672
#define CLC2CON_INTP                  1673
#define CLC2CON_OUT                   1674
#define LC2OUT                        1675
#define CLC2CON_EN                    1676
#define LC2EN                         1677
#define CLC2POL                       1678
#define LC2G1POL                      1679
#define CLC2POL_G1POL                 1680
#define LC2G2POL                      1681
#define CLC2POL_G2POL                 1682
#define LC2G3POL                      1683
#define CLC2POL_G3POL                 1684
#define LC2G4POL                      1685
#define CLC2POL_G4POL                 1686
#define CLC2POL_POL                   1687
#define LC2POL                        1688
#define CLC2SEL0                      1689
#define CLC2SEL0_D1S                  1690
#define LC2D1S0                       1691
#define CLC2SEL0_D1S0                 1692
#define LC2D1S                        1693
#define LC2D1S1                       1694
#define CLC2SEL0_D1S1                 1695
#define LC2D1S2                       1696
#define CLC2SEL0_D1S2                 1697
#define CLC2SEL0_D1S3                 1698
#define LC2D1S3                       1699
#define LC2D1S4                       1700
#define CLC2SEL0_D1S4                 1701
#define LC2D1S5                       1702
#define CLC2SEL0_D1S5                 1703
#define CLC2SEL1                      1704
#define LC2D2S0                       1705
#define CLC2SEL1_D2S0                 1706
#define LC2D2S                        1707
#define CLC2SEL1_D2S                  1708
#define LC2D2S1                       1709
#define CLC2SEL1_D2S1                 1710
#define LC2D2S2                       1711
#define CLC2SEL1_D2S2                 1712
#define LC2D2S3                       1713
#define CLC2SEL1_D2S3                 1714
#define LC2D2S4                       1715
#define CLC2SEL1_D2S4                 1716
#define LC2D2S5                       1717
#define CLC2SEL1_D2S5                 1718
#define CLC2SEL2                      1719
#define CLC2SEL2_D3S                  1720
#define LC2D3S0                       1721
#define CLC2SEL2_D3S0                 1722
#define LC2D3S                        1723
#define CLC2SEL2_D3S1                 1724
#define LC2D3S1                       1725
#define LC2D3S2                       1726
#define CLC2SEL2_D3S2                 1727
#define LC2D3S3                       1728
#define CLC2SEL2_D3S3                 1729
#define LC2D3S4                       1730
#define CLC2SEL2_D3S4                 1731
#define LC2D3S5                       1732
#define CLC2SEL2_D3S5                 1733
#define CLC2SEL3                      1734
#define LC2D4S0                       1735
#define CLC2SEL3_D4S                  1736
#define CLC2SEL3_D4S0                 1737
#define LC2D4S                        1738
#define LC2D4S1                       1739
#define CLC2SEL3_D4S1                 1740
#define LC2D4S2                       1741
#define CLC2SEL3_D4S2                 1742
#define CLC2SEL3_D4S3                 1743
#define LC2D4S3                       1744
#define LC2D4S4                       1745
#define CLC2SEL3_D4S4                 1746
#define LC2D4S5                       1747
#define CLC2SEL3_D4S5                 1748
#define CLC2GLS0                      1749
#define LC2G1D1N                      1750
#define CLC2GLS0_D1N                  1751
#define CLC2GLS0_D1T                  1752
#define LC2G1D1T                      1753
#define LC2G1D2N                      1754
#define CLC2GLS0_D2N                  1755
#define CLC2GLS0_D2T                  1756
#define LC2G1D2T                      1757
#define LC2G1D3N                      1758
#define CLC2GLS0_D3N                  1759
#define CLC2GLS0_D3T                  1760
#define LC2G1D3T                      1761
#define LC2G1D4N                      1762
#define CLC2GLS0_D4N                  1763
#define CLC2GLS0_D4T                  1764
#define LC2G1D4T                      1765
#define CLC2GLS1                      1766
#define CLC2GLS1_D1N                  1767
#define LC2G2D1N                      1768
#define CLC2GLS1_D1T                  1769
#define LC2G2D1T                      1770
#define CLC2GLS1_D2N                  1771
#define LC2G2D2N                      1772
#define CLC2GLS1_D2T                  1773
#define LC2G2D2T                      1774
#define LC2G2D3N                      1775
#define CLC2GLS1_D3N                  1776
#define LC2G2D3T                      1777
#define CLC2GLS1_D3T                  1778
#define LC2G2D4N                      1779
#define CLC2GLS1_D4N                  1780
#define LC2G2D4T                      1781
#define CLC2GLS1_D4T                  1782
#define CLC2GLS2                      1783
#define LC2G3D1N                      1784
#define CLC2GLS2_D1N                  1785
#define CLC2GLS2_D1T                  1786
#define LC2G3D1T                      1787
#define CLC2GLS2_D2N                  1788
#define LC2G3D2N                      1789
#define LC2G3D2T                      1790
#define CLC2GLS2_D2T                  1791
#define CLC2GLS2_D3N                  1792
#define LC2G3D3N                      1793
#define CLC2GLS2_D3T                  1794
#define LC2G3D3T                      1795
#define CLC2GLS2_D4N                  1796
#define LC2G3D4N                      1797
#define LC2G3D4T                      1798
#define CLC2GLS2_D4T                  1799
#define CLC2GLS3                      1800
#define LC2G4D1N                      1801
#define CLC2GLS3_G4D1N                1802
#define CLC2GLS3_G4D1T                1803
#define LC2G4D1T                      1804
#define CLC2GLS3_G4D2N                1805
#define LC2G4D2N                      1806
#define LC2G4D2T                      1807
#define CLC2GLS3_G4D2T                1808
#define CLC2GLS3_G4D3N                1809
#define LC2G4D3N                      1810
#define CLC2GLS3_G4D3T                1811
#define LC2G4D3T                      1812
#define LC2G4D4N                      1813
#define CLC2GLS3_G4D4N                1814
#define CLC2GLS3_G4D4T                1815
#define LC2G4D4T                      1816
#define CLC3CON                       1817
#define LC3MODE                       1818
#define CLC3CON_MODE0                 1819
#define LC3MODE0                      1820
#define CLC3CON_MODE                  1821
#define CLC3CON_MODE1                 1822
#define LC3MODE1                      1823
#define CLC3CON_MODE2                 1824
#define LC3MODE2                      1825
#define LC3INTN                       1826
#define CLC3CON_INTN                  1827
#define LC3INTP                       1828
#define CLC3CON_INTP                  1829
#define LC3OUT                        1830
#define CLC3CON_OUT                   1831
#define LC3EN                         1832
#define CLC3CON_EN                    1833
#define CLC3POL                       1834
#define LC3G1POL                      1835
#define CLC3POL_G1POL                 1836
#define LC3G2POL                      1837
#define CLC3POL_G2POL                 1838
#define CLC3POL_G3POL                 1839
#define LC3G3POL                      1840
#define LC3G4POL                      1841
#define CLC3POL_G4POL                 1842
#define LC3POL                        1843
#define CLC3POL_POL                   1844
#define CLC3SEL0                      1845
#define CLC3SEL0_D1S0                 1846
#define LC3D1S0                       1847
#define CLC3SEL0_D1S                  1848
#define LC3D1S                        1849
#define LC3D1S1                       1850
#define CLC3SEL0_D1S1                 1851
#define LC3D1S2                       1852
#define CLC3SEL0_D1S2                 1853
#define LC3D1S3                       1854
#define CLC3SEL0_D1S3                 1855
#define LC3D1S4                       1856
#define CLC3SEL0_D1S4                 1857
#define LC3D1S5                       1858
#define CLC3SEL0_D1S5                 1859
#define CLC3SEL1                      1860
#define CLC3SEL1_D2S                  1861
#define CLC3SEL1_D2S0                 1862
#define LC3D2S                        1863
#define LC3D2S0                       1864
#define CLC3SEL1_D2S1                 1865
#define LC3D2S1                       1866
#define CLC3SEL1_D2S2                 1867
#define LC3D2S2                       1868
#define CLC3SEL1_D2S3                 1869
#define LC3D2S3                       1870
#define CLC3SEL1_D2S4                 1871
#define LC3D2S4                       1872
#define CLC3SEL1_D2S5                 1873
#define LC3D2S5                       1874
#define CLC3SEL2                      1875
#define LC3D3S                        1876
#define CLC3SEL2_D3S                  1877
#define LC3D3S0                       1878
#define CLC3SEL2_D3S0                 1879
#define LC3D3S1                       1880
#define CLC3SEL2_D3S1                 1881
#define LC3D3S2                       1882
#define CLC3SEL2_D3S2                 1883
#define LC3D3S3                       1884
#define CLC3SEL2_D3S3                 1885
#define CLC3SEL2_D3S4                 1886
#define LC3D3S4                       1887
#define CLC3SEL2_D3S5                 1888
#define LC3D3S5                       1889
#define CLC3SEL3                      1890
#define CLC3SEL3_D4S0                 1891
#define LC3D4S0                       1892
#define CLC3SEL3_D4S                  1893
#define LC3D4S                        1894
#define LC3D4S1                       1895
#define CLC3SEL3_D4S1                 1896
#define LC3D4S2                       1897
#define CLC3SEL3_D4S2                 1898
#define LC3D4S3                       1899
#define CLC3SEL3_D4S3                 1900
#define LC3D4S4                       1901
#define CLC3SEL3_D4S4                 1902
#define LC3D4S5                       1903
#define CLC3SEL3_D4S5                 1904
#define CLC3GLS0                      1905
#define CLC3GLS0_D1N                  1906
#define LC3G1D1N                      1907
#define LC3G1D1T                      1908
#define CLC3GLS0_D1T                  1909
#define LC3G1D2N                      1910
#define CLC3GLS0_D2N                  1911
#define CLC3GLS0_D2T                  1912
#define LC3G1D2T                      1913
#define CLC3GLS0_D3N                  1914
#define LC3G1D3N                      1915
#define LC3G1D3T                      1916
#define CLC3GLS0_D3T                  1917
#define CLC3GLS0_D4N                  1918
#define LC3G1D4N                      1919
#define CLC3GLS0_D4T                  1920
#define LC3G1D4T                      1921
#define CLC3GLS1                      1922
#define LC3G2D1N                      1923
#define CLC3GLS1_D1N                  1924
#define CLC3GLS1_D1T                  1925
#define LC3G2D1T                      1926
#define LC3G2D2N                      1927
#define CLC3GLS1_D2N                  1928
#define LC3G2D2T                      1929
#define CLC3GLS1_D2T                  1930
#define LC3G2D3N                      1931
#define CLC3GLS1_D3N                  1932
#define CLC3GLS1_D3T                  1933
#define LC3G2D3T                      1934
#define LC3G2D4N                      1935
#define CLC3GLS1_D4N                  1936
#define LC3G2D4T                      1937
#define CLC3GLS1_D4T                  1938
#define CLC3GLS2                      1939
#define LC3G3D1N                      1940
#define CLC3GLS2_D1N                  1941
#define LC3G3D1T                      1942
#define CLC3GLS2_D1T                  1943
#define CLC3GLS2_D2N                  1944
#define LC3G3D2N                      1945
#define CLC3GLS2_D2T                  1946
#define LC3G3D2T                      1947
#define CLC3GLS2_D3N                  1948
#define LC3G3D3N                      1949
#define LC3G3D3T                      1950
#define CLC3GLS2_D3T                  1951
#define CLC3GLS2_D4N                  1952
#define LC3G3D4N                      1953
#define CLC3GLS2_D4T                  1954
#define LC3G3D4T                      1955
#define CLC3GLS3                      1956
#define LC3G4D1N                      1957
#define CLC3GLS3_G4D1N                1958
#define LC3G4D1T                      1959
#define CLC3GLS3_G4D1T                1960
#define LC3G4D2N                      1961
#define CLC3GLS3_G4D2N                1962
#define CLC3GLS3_G4D2T                1963
#define LC3G4D2T                      1964
#define LC3G4D3N                      1965
#define CLC3GLS3_G4D3N                1966
#define CLC3GLS3_G4D3T                1967
#define LC3G4D3T                      1968
#define LC3G4D4N                      1969
#define CLC3GLS3_G4D4N                1970
#define LC3G4D4T                      1971
#define CLC3GLS3_G4D4T                1972
#define CLC4CON                       1973
#define LC4MODE                       1974
#define CLC4CON_MODE                  1975
#define LC4MODE0                      1976
#define CLC4CON_MODE0                 1977
#define LC4MODE1                      1978
#define CLC4CON_MODE1                 1979
#define LC4MODE2                      1980
#define CLC4CON_MODE2                 1981
#define LC4INTN                       1982
#define CLC4CON_INTN                  1983
#define CLC4CON_INTP                  1984
#define LC4INTP                       1985
#define CLC4CON_OUT                   1986
#define LC4OUT                        1987
#define CLC4CON_EN                    1988
#define LC4EN                         1989
#define CLC4POL                       1990
#define CLC4POL_G1POL                 1991
#define LC4G1POL                      1992
#define CLC4POL_G2POL                 1993
#define LC4G2POL                      1994
#define CLC4POL_G3POL                 1995
#define LC4G3POL                      1996
#define LC4G4POL                      1997
#define CLC4POL_G4POL                 1998
#define LC4POL                        1999
#define CLC4POL_POL                   2000
#define CLC4SEL0                      2001
#define CLC4SEL0_D1S0                 2002
#define LC4D1S0                       2003
#define CLC4SEL0_D1S                  2004
#define LC4D1S                        2005
#define CLC4SEL0_D1S1                 2006
#define LC4D1S1                       2007
#define CLC4SEL0_D1S2                 2008
#define LC4D1S2                       2009
#define CLC4SEL0_D1S3                 2010
#define LC4D1S3                       2011
#define CLC4SEL0_D1S4                 2012
#define LC4D1S4                       2013
#define CLC4SEL0_D1S5                 2014
#define LC4D1S5                       2015
#define CLC4SEL1                      2016
#define LC4D2S0                       2017
#define CLC4SEL1_D2S                  2018
#define CLC4SEL1_D2S0                 2019
#define LC4D2S                        2020
#define CLC4SEL1_D2S1                 2021
#define LC4D2S1                       2022
#define LC4D2S2                       2023
#define CLC4SEL1_D2S2                 2024
#define LC4D2S3                       2025
#define CLC4SEL1_D2S3                 2026
#define LC4D2S4                       2027
#define CLC4SEL1_D2S4                 2028
#define LC4D2S5                       2029
#define CLC4SEL1_D2S5                 2030
#define CLC4SEL2                      2031
#define LC4D3S                        2032
#define CLC4SEL2_D3S                  2033
#define CLC4SEL2_D3S0                 2034
#define LC4D3S0                       2035
#define LC4D3S1                       2036
#define CLC4SEL2_D3S1                 2037
#define CLC4SEL2_D3S2                 2038
#define LC4D3S2                       2039
#define CLC4SEL2_D3S3                 2040
#define LC4D3S3                       2041
#define CLC4SEL2_D3S4                 2042
#define LC4D3S4                       2043
#define CLC4SEL2_D3S5                 2044
#define LC4D3S5                       2045
#define CLC4SEL3                      2046
#define LC4D4S0                       2047
#define LC4D4S                        2048
#define CLC4SEL3_D4S0                 2049
#define CLC4SEL3_D4S                  2050
#define LC4D4S1                       2051
#define CLC4SEL3_D4S1                 2052
#define LC4D4S2                       2053
#define CLC4SEL3_D4S2                 2054
#define LC4D4S3                       2055
#define CLC4SEL3_D4S3                 2056
#define LC4D4S4                       2057
#define CLC4SEL3_D4S4                 2058
#define LC4D4S5                       2059
#define CLC4SEL3_D4S5                 2060
#define CLC4GLS0                      2061
#define CLC4GLS0_D1N                  2062
#define LC4G1D1N                      2063
#define CLC4GLS0_D1T                  2064
#define LC4G1D1T                      2065
#define CLC4GLS0_D2N                  2066
#define LC4G1D2N                      2067
#define CLC4GLS0_D2T                  2068
#define LC4G1D2T                      2069
#define CLC4GLS0_D3N                  2070
#define LC4G1D3N                      2071
#define CLC4GLS0_D3T                  2072
#define LC4G1D3T                      2073
#define CLC4GLS0_D4N                  2074
#define LC4G1D4N                      2075
#define CLC4GLS0_D4T                  2076
#define LC4G1D4T                      2077
#define CLC4GLS1                      2078
#define CLC4GLS1_D1N                  2079
#define LC4G2D1N                      2080
#define CLC4GLS1_D1T                  2081
#define LC4G2D1T                      2082
#define LC4G2D2N                      2083
#define CLC4GLS1_D2N                  2084
#define LC4G2D2T                      2085
#define CLC4GLS1_D2T                  2086
#define CLC4GLS1_D3N                  2087
#define LC4G2D3N                      2088
#define LC4G2D3T                      2089
#define CLC4GLS1_D3T                  2090
#define CLC4GLS1_D4N                  2091
#define LC4G2D4N                      2092
#define CLC4GLS1_D4T                  2093
#define LC4G2D4T                      2094
#define CLC4GLS2                      2095
#define CLC4GLS2_D1N                  2096
#define LC4G3D1N                      2097
#define CLC4GLS2_D1T                  2098
#define LC4G3D1T                      2099
#define LC4G3D2N                      2100
#define CLC4GLS2_D2N                  2101
#define LC4G3D2T                      2102
#define CLC4GLS2_D2T                  2103
#define CLC4GLS2_D3N                  2104
#define LC4G3D3N                      2105
#define CLC4GLS2_D3T                  2106
#define LC4G3D3T                      2107
#define LC4G3D4N                      2108
#define CLC4GLS2_D4N                  2109
#define LC4G3D4T                      2110
#define CLC4GLS2_D4T                  2111
#define CLC4GLS3                      2112
#define CLC4GLS3_G4D1N                2113
#define LC4G4D1N                      2114
#define LC4G4D1T                      2115
#define CLC4GLS3_G4D1T                2116
#define LC4G4D2N                      2117
#define CLC4GLS3_G4D2N                2118
#define LC4G4D2T                      2119
#define CLC4GLS3_G4D2T                2120
#define CLC4GLS3_G4D3N                2121
#define LC4G4D3N                      2122
#define CLC4GLS3_G4D3T                2123
#define LC4G4D3T                      2124
#define LC4G4D4N                      2125
#define CLC4GLS3_G4D4N                2126
#define LC4G4D4T                      2127
#define CLC4GLS3_G4D4T                2128
#define STATUS_SHAD                   2129
#define C_SHAD                        2130
#define DC_SHAD                       2131
#define Z_SHAD                        2132
#define WREG_SHAD                     2133
#define BSR_SHAD                      2134
#define PCLATH_SHAD                   2135
#define FSR0L_SHAD                    2136
#define FSR0H_SHAD                    2137
#define FSR1L_SHAD                    2138
#define FSR1H_SHAD                    2139
#define STKPTR                        2140
#define TOSL                          2141
#define TOSH                          2142

#endif // _PIC16F18326_H_
